app/views/users/show.html.erb

  <div class="span8">
    <% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 3