app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 101
---
  <span>
    <%= pluralize(current_user.microposts.count, "micropost") %>