app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "yhid d;;kasj\r\n\r\na;skdf\r\nasdfo;asfdij"], ["created_at", Wed, 10 Oct 2012 04:28:53 UTC +00:00], ["updated_at", Wed, 10 Oct 2012 04:28:53 UTC +00:00], ["user_id", 101]]