app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_digest" = '$2a$10$NmAScrdm4hc7plHYAckXLuVaEMGlqHO/tRxJ6c8OeVfOClcWfeCC.', "remember_token" = 'jcGmpu5m0qEljQRlRyNe8Q', "updated_at" = '2012-07-09 02:29:47.238910' WHERE "users"."id" = 5